In [3]:
import numpy as np
import pandas as pd
print("Hello World")

Hello World

In [4]:
data = pd.Series(np.random.randn(9),
  index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
  [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.028387
   2   -0.680884
   3   -0.926598
b  1    0.260187
   3    0.277204
c  1   -0.437547
   2   -0.859552
d  2    0.965439
   3   -0.486151
dtype: float64

In [5]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [9]:
data['b':'d']

b  1    0.260187
   3    0.277204
c  1   -0.437547
   2   -0.859552
d  2    0.965439
   3   -0.486151
dtype: float64

In [8]:
 data.loc[['b', 'd']]

b  1    0.260187
   3    0.277204
d  2    0.965439
   3   -0.486151
dtype: float64

In [11]:
print(data)
data.loc[:, 2]

a  1    0.028387
   2   -0.680884
   3   -0.926598
b  1    0.260187
   3    0.277204
c  1   -0.437547
   2   -0.859552
d  2    0.965439
   3   -0.486151
dtype: float64

a   -0.680884
c   -0.859552
d    0.965439
dtype: float64

In [12]:
data.unstack()

          1         2         3
a  0.028387 -0.680884 -0.926598
b  0.260187       NaN  0.277204
c -0.437547 -0.859552       NaN
d       NaN  0.965439 -0.486151

In [15]:
data.unstack().stack()

a  1    0.028387
   2   -0.680884
   3   -0.926598
b  1    0.260187
   3    0.277204
c  1   -0.437547
   2   -0.859552
d  2    0.965439
   3   -0.486151
dtype: float64

In [17]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
  columns=[['Ohio', 'Ohio', 'Colorado'],
  ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [22]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [23]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [24]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [31]:
print(frame)
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [32]:
print(frame)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [39]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [40]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [48]:
print(frame)
frame.sum(level='color', axis=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [49]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
  'c': ['one', 'one', 'one', 'two', 'two',
  'two', 'two'],
  'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [59]:
frame2=frame.set_index(['c', 'd'], drop=False)
frame2

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [62]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
'data2': range(3)})
print(df1)
print(df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6
  key  data2
0   a      0
1   b      1
2   d      2

In [63]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [64]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [67]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
  'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
  'data2': range(3)})
print(df3) 
df4

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

  rkey  data2
0    a      0
1    b      1
2    d      2

In [68]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0